//---------------------------------------------------------------------------

#ifndef FastFourieTransform_OddH
#define FastFourieTransform_OddH
//---------------------------------------------------------------------------
#include "WinRDefs.h"
#include "FastFourieTransform.h"
//----------------------------------------------------------------------------
void __fastcall dfft_odd(vector<short>&,TCoeff_BY_2&);    //Прямое преобразование Фурье для нечетных отсчетов
//---------------------------------------------------------------------------
#endif
