//---------------------------------------------------------------------------

#ifndef FileFourieTransform_OddH
#define FileFourieTransform_OddH
//---------------------------------------------------------------------------
#include "WinRDefs.h"
#include "FastFourieTransform.h"

//----------------------------------------------------------------------------
void __fastcall dfft_odd(vector<short>&,TCoeff_BY_2&);    //Прямое преобразование Фурье для нечетных отсчетов
void __fastcall rdft_odd(vector<complex<double> >&,TCoeff_BY_2&); //Прямое преобразование Фурье для нечетных гармоник
//---------------------------------------------------------------------------
#endif
