//---------------------------------------------------------------------------

#ifndef Reverse_Fast_Fourie_Transform_OddH
#define Reverse_Fast_Fourie_Transform_OddH
//---------------------------------------------------------------------------
#include "WinRDefs.h"
#include "FastFourieTransform.h"
//----------------------------------------------------------------------------
void __fastcall rdft_odd(vector<complex<double> >&,TCoeff_BY_2&); //Прямое преобразование Фурье для нечетных гармоник
//----------------------------------------------------------------------------
#endif
